{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
      {
        "id": 0,
        "content": "<bos>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 1,
        "content": "<pad>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 2,
        "content": "<eos>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 3,
        "content": "<unk>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 4,
        "content": "<mask>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      }
    ],
    "normalizer": null,
    "pre_tokenizer": null,
    "post_processor": {
      "type": "TemplateProcessing",
      "single": [
        {
          "SpecialToken": {
            "id": "<bos>",
            "type_id": 0
          }
        },
        {
          "Sequence": {
            "id": "A",
            "type_id": 0
          }
        },
        {
          "SpecialToken": {
            "id": "<eos>",
            "type_id": 0
          }
        }
      ],
      "pair": [
        {
          "SpecialToken": {
            "id": "<bos>",
            "type_id": 0
          }
        },
        {
          "Sequence": {
            "id": "A",
            "type_id": 0
          }
        },
        {
          "SpecialToken": {
            "id": "<eos>",
            "type_id": 0
          }
        },
        {
          "Sequence": {
            "id": "B",
            "type_id": 1
          }
        },
        {
          "SpecialToken": {
            "id": "<eos>",
            "type_id": 1
          }
        }
      ],
      "special_tokens": {
        "<bos>": {
          "id": "<bos>",
          "ids": [
            0
          ],
          "tokens": [
            "<bos>"
          ]
        },
        "<eos>": {
          "id": "<eos>",
          "ids": [
            2
          ],
          "tokens": [
            "<eos>"
          ]
        }
      }
    },
    "decoder": null,
    "model": {
      "type": "BPE",
      "dropout": null,
      "unk_token": "<unk>",
      "continuing_subword_prefix": null,
      "end_of_word_suffix": null,
      "fuse_unk": false,
      "byte_fallback": false,
      "ignore_merges": true,
      "vocab": {
        "<bos>": 0,
        "<pad>": 1,
        "<eos>": 2,
        "<unk>": 3,
        "<mask>": 4,
        "|": 5,
        "L": 6,
        "A": 7,
        "G": 8,
        "V": 9,
        "S": 10,
        "E": 11,
        "R": 12,
        "T": 13,
        "I": 14,
        "D": 15,
        "P": 16,
        "K": 17,
        "Q": 18,
        "N": 19,
        "F": 20,
        "Y": 21,
        "M": 22,
        "H": 23,
        "W": 24,
        "C": 25,
        "B": 26
      },
      "merges": []
    }
  }